"""Быстрый запуск RAG системы - минимальный код для старта с маленькой моделью."""

from rag.rag_system import RAGSystem

# Настройки (измените под свои файлы)
ONTOLOGY_FILES = [
    r"c:\Users\just_\Downloads\graph(5).json",
    r"c:\Users\just_\Downloads\graph (2).json"
]

# ОПТИМИЗАЦИЯ ДЛЯ БЫСТРОГО ЗАПУСКА:
# 1. Используем очень маленькую модель (TinyLlama ~1.1B параметров)
#    Альтернативы: "microsoft/Phi-3-mini-4k-instruct", "gpt2", "TinyLlama/TinyLlama-1.1B-Chat-v1.0"
SMALL_MODEL = "TinyLlama/TinyLlama-1.1B-Chat-v1.0"

# 2. Минимальное количество узлов для поиска
N_NODES = 3  # Первый поиск
M_NODES = 2  # Второй поиск

print("🚀 Быстрый запуск RAG с маленькой моделью...")
print(f"📦 Модель: {SMALL_MODEL}")
print(f"⚙️  Параметры поиска: N={N_NODES}, M={M_NODES}\n")

# Быстрая инициализация
rag = RAGSystem(
    ontology_files=ONTOLOGY_FILES,
    llm_model_name=SMALL_MODEL,
    cache_dir="./rag_cache",  # Используем кэш для быстрой загрузки эмбеддингов
    n_nodes=N_NODES,
    m_nodes=M_NODES
)

# Оптимизируем генератор для быстрой работы (уже установлено по умолчанию)
# rag.llm_generator.max_length = 256  # Меньше токенов = быстрее
# rag.llm_generator.temperature = 0.3  # Меньше случайности = быстрее

# Задайте вопрос
question = "Кто запустил EXP-001?"
print(f"\n❓ Вопрос: {question}\n")

# Получите ответ
answer = rag.query(question, verbose=False)
print(f"✅ Ответ: {answer}")

